surfaceWater/dataProcess/FFT_LES(120s)/system/boundaryProbes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a specified list of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/

fields (p);

points
(
    (0 0 0)
    (0.01 0.0015 0)
    (0.02 0.003 0)
    (0.03 0.0045 0)
    (0.04 0.006 0)
    (0.05 0.0075 0)
    (0.06 0.006 0)
    (0.07 0.0045 0)
    (0.08 0.003 0)
    (0.09 0.0015 0)
    (0.1 0 0)
    (0.11 -0.0015 0)
    (0.12 -0.003 0)
    (0.13 -0.0045 0)
    (0.14 -0.006 0)
    (0.15 -0.0075 0)
);

maxDistance 0.01;

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

interpolationScheme cell;
setFormat raw;

patches     ("bottom");

#includeEtc "caseDicts/postProcessing/probes/boundaryProbes.cfg"

executeControl  timeStep;
writeControl	timeStep;
writeInterval	1;


// ************************************************************************* //
