surfaceWater/dataProcess/FFT_LES(120s)/system/lineAtMid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

//Location 1-Top

start   (0.075  0.0000  0.145);
end     (0.075  0.0975  0.145);
fields  (p U);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

writeControl	timeStep;
writeInterval	1;

// Override settings here, e.g.

setConfig
{
    type lineCell;
    axis y;        // y, z, xyz
}

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"


// ************************************************************************* //
