surfaceWater/dataProcess/FFT_LES(120s)/Allrun.sh
decomposePar
mpirun -np 8 pimpleWithG -parallel
reconstructPar
foamToVTK
rm -r processor*
